china-djyos/djyos/djysdk/djysrc/bsp/cpudrv/stm32f7/src/cpu_peri_eth.c
// =============================================================================
// Copyright (C) 2012-2020 长园继保自动化有限公司 All Rights Reserved
// 文件名     ：cpu_peri_eth.c
// 模块描述: GMAC模块底层硬件驱动，为DJYIP的协议栈特定的驱动
// 模块版本: V1.00
// 创建人员: HM
// 创建时间: 02/13.2017
// =============================================================================
#include <stdio.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include <sys/socket.h>
#include <cpu_peri.h>
#include <board-config.h>

#include "stm32f7xx_hal.h"
#include "stm32f7xx_hal_eth.h"

#define CN_DEVNAME_LEN 32
//this is the mac receive hook, if any hook rcv,then the data will goto the hook
//the receive data goto the stack default
typedef bool_t (*fnRcvDeal)(u8 *buf, u16 len);

typedef struct
{
    vu32  Ints;                     //the int counter
    vu32  rcvInts;                  //rcv ints counter
    vu32  dmaerr;                   //dmaerr ins counter
    vu32  rxoverInts;               //rcv over ints counter
    vu32  rcvPkgTimes;              //rcv package times
    vu32  sndTimes;                 //the snd times counter
    vu32  sndOkTimes;               //the send success counter
    vu32  sndnobdCnt;             	//not enough bd rings
    vu32  sndPkgTooLongCnt;			//snd pkg too long ounter
    vu32  sndInts;                  //the send ints counter
    vu32  rxTaskRun;                //the rx task run counter
    vu32  rsttimes;                 //the reset counter
    vu32  nopkgCnts;				//the no pkg free
}tagMacDebug;

ETH_HandleTypeDef sEthHandle;
typedef struct
{
    //os member
    struct SemaphoreLCB   	*rcvsync;          //activate the receive task
    struct MutexLCB       	*protect;          //protect the device
    ptu32_t                	devhandle;        //returned by the tcpip stack
    char                   	devname[CN_DEVNAME_LEN];
    //hardware
    ETH_HandleTypeDef 		*EthHandle;
    //which used to descript the device or control the device
    struct devstat
    {
        vu32 pm:1;        //1 copy all the frame ,no addr filter
        vu32 bfd:1;       //1 broadcast frames disable
        vu32 duplex:1;    //1 full while 0 half
        vu32 speed:1;     //1 means 100Mb while 0 10 Mb
        vu32 mii:1;       //1 means mii mode while 0 rmii mode
    }macstat;
    u8            macaddr[CN_MACADDR_LEN];    //storage the mac address
    //dev method
    vu32 loop:1;      	  //1 use the loop mode while 0 interrupt mode
    vu32 loopcycle:31;	  //unit:ms
    fnRcvDeal     fnrcvhook;                  //rcv hook function
    tagMacDebug   debuginfo;                  //debug info
}tagMacDriver;
static tagMacDriver  gMacDriver;

#ifdef __GNUC__

//define the descriptors and buffers
#define EthRxDescs		8
#define EthTxDescs		8
#define EthRxBufSize	1524
#define EthTxBufSize	1524
ETH_DMADescTypeDef  DMARxDscrTab[EthRxDescs] __attribute__((section(".nocacheram")));
ETH_DMADescTypeDef  DMATxDscrTab[EthTxDescs] __attribute__((section(".nocacheram")));

u8 Rx_Buff[EthRxDescs][EthRxBufSize] __attribute__((section(".nocacheram")));
u8 Tx_Buff[EthTxDescs][EthTxBufSize] __attribute__((section(".nocacheram")));
#endif
static u8 gTxBuffer[EthRxBufSize];		//for sending copy frame


/*
      RMII_REF_CLK ----------------------> PA1
      RMII_MDIO -------------------------> PA2
      RMII_MDC --------------------------> PC1
      RMII_MII_CRS_DV -------------------> PA7
      RMII_MII_RXD0 ---------------------> PC4
      RMII_MII_RXD1 ---------------------> PC5
      RMII_MII_RXER ---------------------> PG2	//(not used)
      RMII_MII_TX_EN --------------------> PB11
      RMII_MII_TXD0 ---------------------> PG13
      RMII_MII_TXD1 ---------------------> PG14
*/
//static const Pin EthRmiiPins[] = {
//	{GPIO_A,PIN1,GPIO_MODE_AF,GPIO_OTYPE_PP,GPIO_SPEED_HIGH,GPIO_PUPD_NONE,AF11},
//	{GPIO_A,PIN2,GPIO_MODE_AF,GPIO_OTYPE_PP,GPIO_SPEED_HIGH,GPIO_PUPD_NONE,AF11},
//	{GPIO_A,PIN7,GPIO_MODE_AF,GPIO_OTYPE_PP,GPIO_SPEED_HIGH,GPIO_PUPD_NONE,AF11},
//	{GPIO_C,PIN1,GPIO_MODE_AF,GPIO_OTYPE_PP,GPIO_SPEED_HIGH,GPIO_PUPD_NONE,AF11},
//	{GPIO_C,PIN4,GPIO_MODE_AF,GPIO_OTYPE_PP,GPIO_SPEED_HIGH,GPIO_PUPD_NONE,AF11},
//	{GPIO_C,PIN5,GPIO_MODE_AF,GPIO_OTYPE_PP,GPIO_SPEED_HIGH,GPIO_PUPD_NONE,AF11},
//	{GPIO_B,PIN11,GPIO_MODE_AF,GPIO_OTYPE_PP,GPIO_SPEED_HIGH,GPIO_PUPD_NONE,AF11},
//	{GPIO_G,PIN13,GPIO_MODE_AF,GPIO_OTYPE_PP,GPIO_SPEED_HIGH,GPIO_PUPD_NONE,AF11},
//	{GPIO_G,PIN14,GPIO_MODE_AF,GPIO_OTYPE_PP,GPIO_SPEED_HIGH,GPIO_PUPD_NONE,AF11},
//};

// HAL库中调用了该函数
void HAL_ETH_MspInit(ETH_HandleTypeDef *heth)
{
	  __HAL_RCC_GPIOA_CLK_ENABLE();
	  __HAL_RCC_GPIOB_CLK_ENABLE();
	  __HAL_RCC_GPIOC_CLK_ENABLE();
	  __HAL_RCC_GPIOG_CLK_ENABLE();

//	  PIO_Configure(EthPins,PIO_LISTSIZE(EthRmiiPins));

	  /* Enable ETHERNET clock  */
	  __HAL_RCC_ETH_CLK_ENABLE();
}

static void __macbitsset(vu32 *reg,u32 bits)
{
    vu32 value;
    value = *reg;
    value |=bits;
    *reg = value;
    return;
}
static void __macbitsclear(vu32 *reg,u32 bits)
{
    vu32 value;
    value = *reg;
    value &=(~bits);
    *reg = value;
    return;
}

static void ETH_HardDrvInit(tagMacDriver *pDrive)
{
	ETH_HandleTypeDef *heth;

	heth = pDrive->EthHandle;

	// configure ethernet peripheral (GPIOs, clocks, MAC, DMA)
	HAL_ETH_Init(heth);

	// Initialize Tx/Rx Descriptors list: Chain Mode
	HAL_ETH_DMATxDescListInit(heth, DMATxDscrTab, &Tx_Buff[0][0], EthTxDescs,EthTxBufSize);
	HAL_ETH_DMARxDescListInit(heth, DMARxDscrTab, &Rx_Buff[0][0], EthRxDescs,EthRxBufSize);

	/* Enable MAC and DMA transmission and reception */
	HAL_ETH_Start(heth);
}

static void __MacReset(tagMacDriver *pDrive)
{
    if(Lock_MutexPend(pDrive->protect,CN_TIMEOUT_FOREVER))
    {
    	ETH_HardDrvInit(pDrive);
        pDrive->debuginfo.rsttimes++;
        Lock_MutexPost(pDrive->protect);
    }
    return ;
}

static tagNetPkg *__MacRcv(ptu32_t devhandle)
{
	tagNetPkg         *pkg = NULL;
    tagMacDriver      *pDrive;
	ETH_HandleTypeDef *EthHandle;
	volatile ETH_DMADescTypeDef *dmarxdesc;
	u16 CopyBytes,len;
    u8   *dst,*src;

    pDrive = &gMacDriver;
    EthHandle = pDrive->EthHandle;
	// get received frame
	if(HAL_ETH_GetReceivedFrame_IT(EthHandle) != HAL_OK)
		return NULL;

	len = EthHandle->RxFrameInfos.length;
	CopyBytes = len;

