china-djyos/djyos/djysdk/djysrc/bsp/cpudrv/stm32f7/src/cpu_peri_eth.c
	if(len > 0)
	{
		pkg = PkgMalloc(len,CN_PKLGLST_END);
		if(NULL == pkg)
			pDrive->debuginfo.nopkgCnts++;
	}

	if(NULL != pkg)
	{
		dmarxdesc = EthHandle->RxFrameInfos.FSRxDesc;
		dst = (u8 *)(pkg->buf +pkg->offset);
		src = (u8 *)EthHandle->RxFrameInfos.buffer;
		while(CopyBytes > EthRxBufSize)
		{
			memcpy( dst, src, EthRxBufSize);
			CopyBytes -= EthRxBufSize;
			dst += EthRxBufSize;

			dmarxdesc->Status |= ETH_DMARXDESC_OWN;		//release Des to DMA
			dmarxdesc = (ETH_DMADescTypeDef *)(dmarxdesc->Buffer2NextDescAddr);
			src = (u8 *)(dmarxdesc->Buffer1Addr);
		}
		memcpy( dst, src, CopyBytes);
		dmarxdesc->Status |= ETH_DMARXDESC_OWN;

		pkg->datalen = len;
		EthHandle->RxFrameInfos.SegCount =0;
	}
	else		//if malloc pkg failed
	{
		dmarxdesc = EthHandle->RxFrameInfos.FSRxDesc;
		while(CopyBytes > EthRxBufSize)
		{
			CopyBytes -= EthRxBufSize;

			dmarxdesc->Status |= ETH_DMARXDESC_OWN;		//release Des to DMA
			dmarxdesc = (ETH_DMADescTypeDef *)(dmarxdesc->Buffer2NextDescAddr);
		}
		dmarxdesc->Status |= ETH_DMARXDESC_OWN;
		EthHandle->RxFrameInfos.SegCount =0;
	}

	// When Rx Buffer unavailable flag is set: clear it and resume reception
	if ((EthHandle->Instance->DMASR & ETH_DMASR_RBUS) != (uint32_t)RESET)
	{
		// Clear RBUS ETHERNET DMA flag
		EthHandle->Instance->DMASR = ETH_DMASR_RBUS;
		// Resume DMA reception
		EthHandle->Instance->DMARPDR = 0;

		pDrive->debuginfo.rxoverInts++;
	}

	return pkg;
}

static bool_t MacSnd(ptu32_t handle,tagNetPkg * pkg,u32 framelen, u32 netdevtask)
{
    bool_t             result;
    tagMacDriver      *pDrive;
	ETH_HandleTypeDef *EthHandle;
	ETH_DMADescTypeDef *DmaTxDesc;
    tagNetPkg         *tmppkg;
    u8                *dst,*src;
    u16                len=0;

    result = false;
    pDrive = &gMacDriver;
    EthHandle = pDrive->EthHandle;
    pDrive->debuginfo.sndTimes++;
    if((0 == handle)||(NULL == pkg))
        return result;

    if(Lock_MutexPend(pDrive->protect,CN_TIMEOUT_FOREVER))
    {
    	DmaTxDesc = pDrive->EthHandle->TxDesc;
        //Is this buffer available? If not, goto error
        if((DmaTxDesc->Status & ETH_DMATXDESC_OWN) != (uint32_t)RESET)
        {
        	pDrive->debuginfo.sndnobdCnt ++;
        	goto NODESCERROR;
        }

        //copy datas to static frame buffer
        tmppkg = pkg;
        dst      = &gTxBuffer[0];
        do
        {
            src = (tmppkg->buf + tmppkg->offset);
            memcpy(dst,src,tmppkg->datalen);
            dst      += tmppkg->datalen;
            len      += tmppkg->datalen;
            if(PKG_ISLISTEND(tmppkg))
            {
                tmppkg = NULL;
                break;
            }
            else
            {
                tmppkg = tmppkg->partnext;
            }
        }while(NULL != tmppkg );

        if(len < EthTxBufSize)
        {
        	src = &gTxBuffer[0];
        	dst = (u8 *)(EthHandle->TxDesc->Buffer1Addr);
        	memcpy( dst,src ,len );
        	// Point to next descriptor
        	DmaTxDesc = (ETH_DMADescTypeDef *)(DmaTxDesc->Buffer2NextDescAddr);
        	//Prepare transmit descriptors to give to DMA
        	if(HAL_OK == HAL_ETH_TransmitFrame(EthHandle, len))
        	{
        		pDrive->debuginfo.sndOkTimes++;
        		result = true;
        	}
        }
        else
        {
        	pDrive->debuginfo.sndPkgTooLongCnt++;
        }

NODESCERROR:
		// When Transmit Underflow flag is set, clear it and issue a Transmit
		//Poll Demand to resume transmission
		if ((EthHandle->Instance->DMASR & ETH_DMASR_TUS) != (uint32_t)RESET)
		{
			// Clear TUS ETHERNET DMA flag
			EthHandle->Instance->DMASR = ETH_DMASR_TUS;

			//Resume DMA transmission
			EthHandle->Instance->DMATPDR = 0;
		}
    	Lock_MutexPost(pDrive->protect);
    }

    return result;
}

u32 ETH_SendData(u8 *buf,u32 len)
{
    tagNetPkg          pkg;
    tagMacDriver      *pDrive;

    pDrive = &gMacDriver;

    pkg.partnext = NULL;
    pkg.pkgflag  = (1<<0);  //只有一个包
    pkg.offset   = 0;
    pkg.datalen  = len;
    pkg.buf      = buf;
    if(MacSnd(pDrive->devhandle,&pkg,len,0))
    {
        return len;
    }
    else
    {
        return 0;
    }
}
//This is the interrut handler
u32 ETH_IntHandler(ufast_t IntLine)
{
    tagMacDriver *pDrive;
    ETH_HandleTypeDef *EthHandle;

    pDrive = &gMacDriver;
    EthHandle = pDrive->EthHandle;

    pDrive->debuginfo.Ints++;
    if (__HAL_ETH_DMA_GET_FLAG(EthHandle, ETH_DMA_FLAG_R))
    {
    	pDrive->debuginfo.rcvInts++;
    	Lock_SempPost(pDrive->rcvsync);
    	__HAL_ETH_DMA_CLEAR_IT(EthHandle, ETH_DMA_IT_R);	//Clear the Eth DMA Rx IT pending bits
    	EthHandle->State = HAL_ETH_STATE_READY;			    //Set HAL State to Ready
    	__HAL_UNLOCK(EthHandle);
    }
    else if (__HAL_ETH_DMA_GET_FLAG(EthHandle, ETH_DMA_FLAG_T))
    {
    	pDrive->debuginfo.sndInts++;
    	__HAL_ETH_DMA_CLEAR_IT(EthHandle, ETH_DMA_IT_T);	//Clear the Eth DMA Tx IT pending bits
    	EthHandle->State = HAL_ETH_STATE_READY;			    //Set HAL State to Ready
    	__HAL_UNLOCK(EthHandle);
    }

    __HAL_ETH_DMA_CLEAR_IT(EthHandle, ETH_DMA_IT_NIS);

    if(__HAL_ETH_DMA_GET_FLAG(EthHandle, ETH_DMA_FLAG_AIS))
    {
    	pDrive->debuginfo.dmaerr++;
		__HAL_ETH_DMA_CLEAR_IT(EthHandle, ETH_DMA_FLAG_AIS);
		EthHandle->State = HAL_ETH_STATE_READY;

		__HAL_UNLOCK(EthHandle);
    }
    return 0;
}
//mac control function
#define EN_NETDEV_ADDRFILTER (EN_NETDEV_CMDLAST + 1)
static bool_t MacCtrl(ptu32_t devhandle,u8 cmd,ptu32_t para)
{
    bool_t result = false;
    tagMacDriver   *pDrive;
#if 1
    pDrive = &gMacDriver;
    if((pDrive->devhandle == devhandle)&&\
        (Lock_MutexPend(pDrive->protect,CN_TIMEOUT_FOREVER)))
    {
        switch(cmd)
        {
            case EN_NETDEV_SETNOPKG:
                if(para)
                {
                	ETH_HardDrvInit(pDrive);
                    pDrive->debuginfo.rsttimes++;
                }
                result = true;
                break;
            case EN_NETDEV_SETBORAD:
                if(para)
                {
                    __macbitsclear(&pDrive->EthHandle->Instance->MACFFR,ETH_MACFFR_BFD);
                    printk("mac broad enable\n\r");
                    pDrive->macstat.bfd = 0;
                }
                else
                {
                    __macbitsset(&pDrive->EthHandle->Instance->MACFFR,ETH_MACFFR_BFD);
                    printk("mac broad disable\n\r");
                    pDrive->macstat.bfd = 1;
                }
                result = true;
                break;
            case EN_NETDEV_SETPOINT:
                if(para)
                {
                	__macbitsclear(&pDrive->EthHandle->Instance->MACFFR,
                			ETH_MACFFR_HU);//绝对单播模式
                }
                else
                {
                	__macbitsset(&pDrive->EthHandle->Instance->MACFFR,
                			ETH_MACFFR_HU);//散列单播模式
                }
                result = true;
                break;
            case EN_NETDEV_SETMULTI:
				if(para)
				{
				   __macbitsset(&pDrive->EthHandle->Instance->MACFFR,
						   ETH_MACFFR_PAM);//pass all multicast
				}
				else
				{
					__macbitsclear(&pDrive->EthHandle->Instance->MACFFR,
							ETH_MACFFR_PAM);//multicast filt
				}
			   result = true;
                break;
            case EN_NETDEV_SETRECV:
                if(para)
                {
                	HAL_ETH_StartReceive(pDrive->EthHandle);
                }
                else
                {
                	HAL_ETH_StopReceive(pDrive->EthHandle);
                }
                result = true;
                break;
            case EN_NETDEV_SETSEND:
            	if(para)
            	{
            		HAL_ETH_StartTransmit(pDrive->EthHandle);
            	}
            	else
            	{
            		HAL_ETH_StopTransmit(pDrive->EthHandle);
            	}
                break;
            case EN_NETDEV_SETMAC:
                memcpy(pDrive->macaddr,(u8 *)para, CN_MACADDR_LEN);
                ETH_HardDrvInit(pDrive);
                pDrive->debuginfo.rsttimes++;
                result = true;
                break;
            case EN_NETDEV_SETMULTIMAC:
                break;
            case EN_NETDEV_GTETMAC:
                if((u8 *)para != NULL)
                {
                    memcpy((u8 *)para,pDrive->macaddr, CN_MACADDR_LEN);
                    result = true;
                }
                break;
            case EN_NETDEV_RESET:
                if(para)
                {
                	ETH_HardDrvInit(pDrive);
                    pDrive->debuginfo.rsttimes++;
                    result = true;
                }
                break;
            case (EN_NETDEV_ADDRFILTER):	//增加一条是否接收所有包
				if(para)
				{
					__macbitsclear(&pDrive->EthHandle->Instance->MACFFR,
							ETH_MACFFR_RA);//addr filter
				}
				else
				{
					__macbitsset(&pDrive->EthHandle->Instance->MACFFR,
											   ETH_MACFFR_RA);//pass all pkg
				}
				break;
            default:
                result = false;
                break;
        }
        Lock_MutexPost(pDrive->protect);
    }

    return result;
#endif
    return true;
}

//this is the receive task
static ptu32_t __MacRcvTask(void)
{
    tagNetPkg *pkg;
    ptu32_t    handle;
    u8        *rawbuf;
    u16        len;
    tagMacDriver      *pDrive;
    pDrive = &gMacDriver;



