china-djyos/djyos/djysdk/djysrc/bsp/cpudrv/stm32f7/src/cpu_peri_eth.c
    return true;
}

bool_t MacReset(char *param)
{
    tagMacDriver   *pDrive = &gMacDriver;

    __MacReset(pDrive);
    return true;
}

bool_t MacSndEn(char *param)
{
    tagMacDriver      *pDrive;


    pDrive = &gMacDriver;
    if(Lock_MutexPend(pDrive->protect,CN_TIMEOUT_FOREVER))
    {
    	HAL_ETH_StartTransmit(pDrive->EthHandle);
        Lock_MutexPost(pDrive->protect);
    }
    return true;
}
bool_t MacSndDis(char *param)
{
    tagMacDriver      *pDrive;

    pDrive = &gMacDriver;
    if(Lock_MutexPend(pDrive->protect,CN_TIMEOUT_FOREVER))
    {
    	HAL_ETH_StopTransmit(pDrive->EthHandle);
        Lock_MutexPost(pDrive->protect);
    }
    return true;
}

bool_t MacAddrFilterEn(char *param)
{
    tagMacDriver      *pDrive;

    pDrive = &gMacDriver;
	MacCtrl(pDrive->devhandle,EN_NETDEV_ADDRFILTER,1);//开通地址过滤功能
	return true;
}
bool_t MacAddrFilterDis(char *param)
{
    tagMacDriver      *pDrive;

    pDrive = &gMacDriver;
	MacCtrl(pDrive->devhandle,EN_NETDEV_ADDRFILTER,0);//关闭地址过滤功能
	return true;
}

#include <shell.h>
static struct ShellCmdTab  gMacDebug[] =
{
    {
        "mac",
        macdebuginfo,
        "usage:gmac",
        NULL
    },
    {
        "macreg",
        MacReg,
        "usage:MacReg",
        NULL
    },
//    {
//        "macpost",
//        gmacpost,
//        "usage:gmacpost",
//        NULL
//    },
//    {
//        "macrcvbd",
//        gmacrcvbdcheck,
//        "usage:gmacrcvbd",
//        NULL
//    },
//    {
//        "macsndbd",
//        gmacsndbdcheck,
//        "usage:gmacsndbd",
//        NULL
//    },
    {
        "macreset",
        MacReset,
        "usage:reset gmac",
        NULL
    },
//    {
//        "macdelay",
//        MacDelay,
//        "usage:MacDelay",
//        NULL
//    },
//    {
//        "macsndbdclear",
//        MacSndBDClear,
//        "usage:MacSndBdClear + ndnum",
//        NULL
//    }
    {
        "macsnden",
        MacSndEn,
        "usage:MacSndEn",
        NULL
    },
    {
        "macsnddis",
        MacSndDis,
        "usage:MacSndDis",
        NULL
    },
	{
        "macfilten",
		MacAddrFilterEn,
        "usage:MacAddrEn, don't receive all frame(MAC filter)",
        NULL
    },
	{
        "macfiltdis",
		MacAddrFilterDis,
        "usage:MacAddrDis, receive all frame(don't care MAC filter)",
        NULL
    },
};

#define CN_GMACDEBUG_NUM  ((sizeof(gMacDebug))/(sizeof(struct ShellCmdTab)))
static struct ShellCmdRsc gMacDebugCmdRsc[CN_GMACDEBUG_NUM];
// =============================================================================
// 功能：GMAC网卡和DJYIP驱动初始化函数
// 参数：para
// 返回值  ：true成功  false失败。
// =============================================================================
bool_t ModuleInstall_ETH(const char *devname, u8 *macaddress,\
                          bool_t loop,u32 loopcycle,\
                          bool_t (*rcvHook)(u8 *buf, u16 len))
{
    tagMacDriver   *pDrive = &gMacDriver;
    tagNetDevPara   devpara;

    memset((void *)pDrive,0,sizeof(tagMacDriver));
    //copy the config para to the pDrive
    memcpy(pDrive->devname,devname,CN_DEVNAME_LEN-1);
    memcpy((void *)pDrive->macaddr,macaddress,CN_MACADDR_LEN);
    if(loop)
    {
        pDrive->loop = 1;
    }
    pDrive->loopcycle = loopcycle;
    pDrive->fnrcvhook = rcvHook;
    //set the work mode and speed
    pDrive->macstat.pm = 0;       	//primmiscuous mode:= 1,no MAC addr filte
    pDrive->macstat.duplex = 1;    //duplex full
    pDrive->macstat.speed = 1;     //100 Mb
    pDrive->macstat.bfd = 0;       //broadcast frames disable
    pDrive->macstat.mii = 0;       //use RMII mode

    pDrive->EthHandle = &sEthHandle;
	pDrive->EthHandle->Instance = ETH;
	pDrive->EthHandle->Init.MACAddr = pDrive->macaddr;
	pDrive->EthHandle->Init.AutoNegotiation = ETH_AUTONEGOTIATION_ENABLE;
	pDrive->EthHandle->Init.Speed = ETH_SPEED_100M;
	pDrive->EthHandle->Init.DuplexMode = ETH_MODE_FULLDUPLEX;
	pDrive->EthHandle->Init.MediaInterface = ETH_MEDIA_INTERFACE_RMII;
	pDrive->EthHandle->Init.RxMode = ETH_RXINTERRUPT_MODE;
	pDrive->EthHandle->Init.ChecksumMode = ETH_CHECKSUM_BY_HARDWARE;//ETH_CHECKSUM_BY_SOFTWARE;
	pDrive->EthHandle->Init.PhyAddress = 0x00;//not used;

	ETH_HardDrvInit(pDrive);

    //all the configuration has set in the pDrive now,we need some sys assistant
    //application some semphore and mutex
    pDrive->rcvsync = Lock_SempCreate(1,1,CN_BLOCK_FIFO,NULL);
    if(NULL == pDrive->rcvsync)
    {
        goto RCVSYNC_FAILED;
    }
    pDrive->protect = Lock_MutexCreate(NULL);
    if(NULL == pDrive->protect)
    {
        goto DEVPROTECT_FAILED;
    }
    MacCtrl(pDrive->devhandle,EN_NETDEV_ADDRFILTER,1);//开通地址过滤功能

    //install the net device
    devpara.ifctrl = MacCtrl;
    devpara.ifsend = MacSnd;
    devpara.iftype = EN_LINK_ETHERNET;
    devpara.devfunc = CN_IPDEV_ALL;
    memcpy(devpara.mac,macaddress,6);
    devpara.name = (char *)pDrive->devname;
    devpara.private = 0;
    devpara.mtu = 1522;
    devpara.private = (ptu32_t)pDrive;
    pDrive->devhandle = NetDevInstall(&devpara);
    if(0 == pDrive->devhandle)
    {
        goto NetInstallFailed;
    }
    if(false == __CreateRcvTask(pDrive->devhandle))
    {
        goto RcvTaskFailed;
    }

    if(false == loop)
    {
        Int_Register(CN_INT_LINE_ETH);
        Int_SettoAsynSignal(CN_INT_LINE_ETH);
        Int_ClearLine(CN_INT_LINE_ETH);
        Int_IsrConnect(CN_INT_LINE_ETH,ETH_IntHandler);
        Int_ContactLine(CN_INT_LINE_ETH);
    }
    Sh_InstallCmd(gMacDebug,gMacDebugCmdRsc,CN_GMACDEBUG_NUM);
    printf("%s:Install Net Device %s success\n\r",__FUNCTION__,devname);
    return true;

RcvTaskFailed:
    NetDevUninstall(devname);
NetInstallFailed:
    Lock_MutexDelete(pDrive->protect);
    pDrive->protect = NULL;
DEVPROTECT_FAILED:
    Lock_SempDelete(pDrive->rcvsync);
    pDrive->rcvsync = NULL;
RCVSYNC_FAILED:
    printf("%s:Install Net Device %s failed\n\r",__FUNCTION__,devname);
    return false;
}


u8 GMAC_MdioR(u8 dev,u8 reg, u16 *value)
{
	u32 rValue;
	tagMacDriver   *pDrive = &gMacDriver;
	pDrive->EthHandle->Init.PhyAddress = dev;

	if(HAL_OK != HAL_ETH_ReadPHYRegister(pDrive->EthHandle,reg,&rValue))
		return 0;
	*value = (u16)rValue;
	return 1;
}
u8 GMAC_MdioW(u8 dev,u8 reg, u16 value)
{
	tagMacDriver   *pDrive = &gMacDriver;
	pDrive->EthHandle->Init.PhyAddress = dev;

	if(HAL_OK != HAL_ETH_WritePHYRegister(pDrive->EthHandle,reg,value))
		return 0;
	return 1;
}


extern void GMAC_InLowPowerPinCfg(void);
extern void GMAC_OutLowPowerPinCfg(void);

// =============================================================================
// 功能： 进入或退出低功耗模式
//     时钟使能 控制器使能 GPIO设置相应的状态
// 参数： port 串口号：如 CN_UART1
//     flag 进入低功耗 或退出低功耗标志：如 UART_IN_LOWPOWER
// 返回：true/false
// =============================================================================
bool_t GMAC_LowPowerConfig(u8 flag)
{
	if(flag == InLowPower)
	{
		RCC->AHB1ENR&=~(1<<25);  //禁能ETHMAC时钟
		GMAC_InLowPowerPinCfg();
		return true;
	}
	else if (flag == OutLowPower)
	{
		 RCC->AHB1ENR|=1<<25;  //使能ETHMAC时钟
		 GMAC_OutLowPowerPinCfg();
		 MacReset(0);
		return true;
	}
	else
		return false;
}
